caotrongphuoc/ble-mesh-tracking/nodes/bmt_gateway/sdkconfig.defaults.esp32s3
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Octal PSRAM 8MB (N16R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
